Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_usart.h
/*
 * SPDX-License-Identifier: MIT
 *
 * Goal:     stm32V873_usart equates.
 */
#pragma once

#include    <stdint.h>

// USART address definitions
// -------------------------

typedef struct {
    volatile    uint32_t    CR1;
    volatile    uint32_t    CR2;
    volatile    uint32_t    CR3;
    volatile    uint32_t    BRR;
    volatile    uint32_t    GTPR;
    volatile    uint32_t    RTOR;
    volatile    uint32_t    RQR;
    volatile    uint32_t    ISR;
    volatile    uint32_t    ICR;
    volatile    uint32_t    RDR;
    volatile    uint32_t    TDR;
    volatile    uint32_t    PRESC;
} USART_TypeDef;

#if (defined(__cplusplus))
#define USART1_NS   reinterpret_cast<USART_TypeDef *>(0x42001000u)
#define USART1_S    reinterpret_cast<USART_TypeDef *>(0x52001000u)
#define USART2_NS   reinterpret_cast<USART_TypeDef *>(0x40004400u)
#define USART2_S    reinterpret_cast<USART_TypeDef *>(0x50004400u)
#define USART3_NS   reinterpret_cast<USART_TypeDef *>(0x40004800u)
#define USART3_S    reinterpret_cast<USART_TypeDef *>(0x50004800u)
#define UART4_NS    reinterpret_cast<USART_TypeDef *>(0x40004C00u)
#define UART4_S     reinterpret_cast<USART_TypeDef *>(0x50004C00u)
#define UART5_NS    reinterpret_cast<USART_TypeDef *>(0x40005000u)
#define UART5_S     reinterpret_cast<USART_TypeDef *>(0x50005000u)
#define USART6_NS   reinterpret_cast<USART_TypeDef *>(0x42001400u)
#define USART6_S    reinterpret_cast<USART_TypeDef *>(0x52001400u)
#define UART7_NS    reinterpret_cast<USART_TypeDef *>(0x40007800u)
#define UART7_S     reinterpret_cast<USART_TypeDef *>(0x50007800u)
#define UART8_NS    reinterpret_cast<USART_TypeDef *>(0x40007C00u)
#define UART8_S     reinterpret_cast<USART_TypeDef *>(0x50007C00u)
#define UART9_NS    reinterpret_cast<USART_TypeDef *>(0x42001800u)
#define UART9_S     reinterpret_cast<USART_TypeDef *>(0x52001800u)
#define USART10_NS  reinterpret_cast<USART_TypeDef *>(0x42001C00u)
#define USART10_S   reinterpret_cast<USART_TypeDef *>(0x52001C00u)

#else
#define USART1_NS   ((USART_TypeDef *)0x42001000u)
#define USART1_S    ((USART_TypeDef *)0x52001000u)
#define USART2_NS   ((USART_TypeDef *)0x40004400u)
#define USART2_S    ((USART_TypeDef *)0x50004400u)
#define USART3_NS   ((USART_TypeDef *)0x40004800u)
#define USART3_S    ((USART_TypeDef *)0x50004800u)
#define UART4_NS    ((USART_TypeDef *)0x40004C00u)
#define UART4_S     ((USART_TypeDef *)0x50004C00u)
#define UART5_NS    ((USART_TypeDef *)0x40005000u)
#define UART5_S     ((USART_TypeDef *)0x50005000u)
#define USART6_NS   ((USART_TypeDef *)0x42001400u)
#define USART6_S    ((USART_TypeDef *)0x52001400u)
#define UART7_NS    ((USART_TypeDef *)0x40007800u)
#define UART7_S     ((USART_TypeDef *)0x50007800u)
#define UART8_NS    ((USART_TypeDef *)0x40007C00u)
#define UART8_S     ((USART_TypeDef *)0x50007C00u)
#define UART9v      ((USART_TypeDef *)0x42001800u)
#define UART9_S     ((USART_TypeDef *)0x52001800u)
#define USART10v    ((USART_TypeDef *)0x42001C00u)
#define USART10_S   ((USART_TypeDef *)0x52001C00u)
#endif

// CR1 Configuration

#define USART_CR1_RXFFIE                                            (0x1u<<31)
#define USART_CR1_TXFEIE                                            (0x1u<<30)
#define USART_CR1_FIFOEN                                            (0x1u<<29)
#define USART_CR1_M1                                                (0x1u<<28)
#define USART_CR1_EOBIE                                             (0x1u<<27)
#define USART_CR1_RTOIE                                             (0x1u<<26)
#define USART_CR1_DEAT                                              (0x1Fu<<21)
#define USART_CR1_DEAT_0                                            (0x1u<<21)
#define USART_CR1_DEDT                                              (0x1Fu<<16)
#define USART_CR1_DEDT_0                                            (0x1u<<16)
#define USART_CR1_OVER8                                             (0x1u<<15)
#define USART_CR1_CMIE                                              (0x1u<<14)
#define USART_CR1_MME                                               (0x1u<<13)
#define USART_CR1_M0                                                (0x1u<<12)
#define USART_CR1_WAKE                                              (0x1u<<11)
#define USART_CR1_PCE                                               (0x1u<<10)
#define USART_CR1_PS                                                (0x1u<<9)
#define USART_CR1_PEIE                                              (0x1u<<8)
#define USART_CR1_TXFNFIE                                           (0x1u<<7)
#define USART_CR1_TCIE                                              (0x1u<<6)
#define USART_CR1_RXFNEIE                                           (0x1u<<5)
#define USART_CR1_IDLEIE                                            (0x1u<<4)
#define USART_CR1_TE                                                (0x1u<<3)
#define USART_CR1_RE                                                (0x1u<<2)
#define USART_CR1_UESM                                              (0x1u<<1)
#define USART_CR1_UE                                                (0x1u<<0)

#define USART_CR1_TXFEIE_B_0X0                                      (0x0u<<30)
#define USART_CR1_TXFEIE_B_0X1                                      (0x1u<<30)
#define USART_CR1_FIFOEN_B_0X0                                      (0x0u<<29)
#define USART_CR1_FIFOEN_B_0X1                                      (0x1u<<29)
#define USART_CR1_EOBIE_B_0X0                                       (0x0u<<27)
#define USART_CR1_EOBIE_B_0X1                                       (0x1u<<27)
#define USART_CR1_RTOIE_B_0X0                                       (0x0u<<26)
#define USART_CR1_RTOIE_B_0X1                                       (0x1u<<26)
#define USART_CR1_OVER8_B_0X0                                       (0x0u<<15)
#define USART_CR1_OVER8_B_0X1                                       (0x1u<<15)
#define USART_CR1_CMIE_B_0X0                                        (0x0u<<14)
#define USART_CR1_CMIE_B_0X1                                        (0x1u<<14)
#define USART_CR1_MME_B_0X0                                         (0x0u<<13)
#define USART_CR1_MME_B_0X1                                         (0x1u<<13)
#define USART_CR1_WAKE_B_0X0                                        (0x0u<<11)
#define USART_CR1_WAKE_B_0X1                                        (0x1u<<11)
#define USART_CR1_PCE_B_0X0                                         (0x0u<<10)
#define USART_CR1_PCE_B_0X1                                         (0x1u<<10)
#define USART_CR1_PS_B_0X0                                          (0x0u<<9)
#define USART_CR1_PS_B_0X1                                          (0x1u<<9)
#define USART_CR1_PEIE_B_0X0                                        (0x0u<<8)
#define USART_CR1_PEIE_B_0X1                                        (0x1u<<8)
#define USART_CR1_TXFNFIE_B_0X0                                     (0x0u<<7)
#define USART_CR1_TXFNFIE_B_0X1                                     (0x1u<<7)
#define USART_CR1_TCIE_B_0X0                                        (0x0u<<6)
#define USART_CR1_TCIE_B_0X1                                        (0x1u<<6)
#define USART_CR1_RXFNEIE_B_0X0                                     (0x0u<<5)
#define USART_CR1_RXFNEIE_B_0X1                                     (0x1u<<5)
#define USART_CR1_IDLEIE_B_0X0                                      (0x0u<<4)
#define USART_CR1_IDLEIE_B_0X1                                      (0x1u<<4)
#define USART_CR1_TE_B_0X0                                          (0x0u<<3)
#define USART_CR1_TE_B_0X1                                          (0x1u<<3)
#define USART_CR1_RE_B_0X0                                          (0x0u<<2)
#define USART_CR1_RE_B_0X1                                          (0x1u<<2)
#define USART_CR1_UESM_B_0X0                                        (0x0u<<1)
#define USART_CR1_UESM_B_0X1                                        (0x1u<<1)
#define USART_CR1_UE_B_0X0                                          (0x0u<<0)
#define USART_CR1_UE_B_0X1                                          (0x1u<<0)

// CR2 Configuration

