Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_usart.h
#define USART_CR2_ADD                                               (0xFFu<<24)
#define USART_CR2_ADD_0                                             (0x1u<<24)
#define USART_CR2_RTOEN                                             (0x1u<<23)
#define USART_CR2_ABRMOD                                            (0x3u<<21)
#define USART_CR2_ABRMOD_0                                          (0x1u<<21)
#define USART_CR2_ABREN                                             (0x1u<<20)
#define USART_CR2_MSBFIRST                                          (0x1u<<19)
#define USART_CR2_DATAINV                                           (0x1u<<18)
#define USART_CR2_TXINV                                             (0x1u<<17)
#define USART_CR2_RXINV                                             (0x1u<<16)
#define USART_CR2_SWAP                                              (0x1u<<15)
#define USART_CR2_LINEN                                             (0x1u<<14)
#define USART_CR2_STOP                                              (0x3u<<12)
#define USART_CR2_STOP_0                                            (0x1u<<12)
#define USART_CR2_CLKEN                                             (0x1u<<11)
#define USART_CR2_CPOL                                              (0x1u<<10)
#define USART_CR2_CPHA                                              (0x1u<<9)
#define USART_CR2_LBCL                                              (0x1u<<8)
#define USART_CR2_LBDIE                                             (0x1u<<6)
#define USART_CR2_LBDL                                              (0x1u<<5)
#define USART_CR2_ADDM7                                             (0x1u<<4)
#define USART_CR2_DIS_NSS                                           (0x1u<<3)
#define USART_CR2_SLVEN                                             (0x1u<<0)

#define USART_CR2_RTOEN_B_0X0                                       (0x0u<<23)
#define USART_CR2_RTOEN_B_0X1                                       (0x1u<<23)
#define USART_CR2_ABRMOD_B_0X0                                      (0x0u<<21)
#define USART_CR2_ABRMOD_B_0X1                                      (0x1u<<21)
#define USART_CR2_ABRMOD_B_0X2                                      (0x2u<<21)
#define USART_CR2_ABRMOD_B_0X3                                      (0x3u<<21)
#define USART_CR2_ABREN_B_0X0                                       (0x0u<<20)
#define USART_CR2_ABREN_B_0X1                                       (0x1u<<20)
#define USART_CR2_MSBFIRST_B_0X0                                    (0x0u<<19)
#define USART_CR2_MSBFIRST_B_0X1                                    (0x1u<<19)
#define USART_CR2_DATAINV_B_0X0                                     (0x0u<<18)
#define USART_CR2_DATAINV_B_0X1                                     (0x1u<<18)
#define USART_CR2_TXINV_B_0X0                                       (0x0u<<17)
#define USART_CR2_TXINV_B_0X1                                       (0x1u<<17)
#define USART_CR2_RXINV_B_0X0                                       (0x0u<<16)
#define USART_CR2_RXINV_B_0X1                                       (0x1u<<16)
#define USART_CR2_SWAP_B_0X0                                        (0x0u<<15)
#define USART_CR2_SWAP_B_0X1                                        (0x1u<<15)
#define USART_CR2_LINEN_B_0X0                                       (0x0u<<14)
#define USART_CR2_LINEN_B_0X1                                       (0x1u<<14)
#define USART_CR2_STOP_B_0X0                                        (0x0u<<12)
#define USART_CR2_STOP_B_0X1                                        (0x1u<<12)
#define USART_CR2_STOP_B_0X2                                        (0x2u<<12)
#define USART_CR2_STOP_B_0X3                                        (0x3u<<12)
#define USART_CR2_CLKEN_B_0X0                                       (0x0u<<11)
#define USART_CR2_CLKEN_B_0X1                                       (0x1u<<11)
#define USART_CR2_CPOL_B_0X0                                        (0x0u<<10)
#define USART_CR2_CPOL_B_0X1                                        (0x1u<<10)
#define USART_CR2_CPHA_B_0X0                                        (0x0u<<9)
#define USART_CR2_CPHA_B_0X1                                        (0x1u<<9)
#define USART_CR2_LBCL_B_0X0                                        (0x0u<<8)
#define USART_CR2_LBCL_B_0X1                                        (0x1u<<8)
#define USART_CR2_LBDIE_B_0X0                                       (0x0u<<6)
#define USART_CR2_LBDIE_B_0X1                                       (0x1u<<6)
#define USART_CR2_LBDL_B_0X0                                        (0x0u<<5)
#define USART_CR2_LBDL_B_0X1                                        (0x1u<<5)
#define USART_CR2_ADDM7_B_0X0                                       (0x0u<<4)
#define USART_CR2_ADDM7_B_0X1                                       (0x1u<<4)
#define USART_CR2_DIS_NSS_B_0X0                                     (0x0u<<3)
#define USART_CR2_DIS_NSS_B_0X1                                     (0x1u<<3)
#define USART_CR2_SLVEN_B_0X0                                       (0x0u<<0)
#define USART_CR2_SLVEN_B_0X1                                       (0x1u<<0)

// CR3 Configuration

#define USART_CR3_TXFTCFG                                           (0x7u<<29)
#define USART_CR3_TXFTCFG_0                                         (0x1u<<29)
#define USART_CR3_RXFTIE                                            (0x1u<<28)
#define USART_CR3_RXFTCFG                                           (0x7u<<25)
#define USART_CR3_RXFTCFG_0                                         (0x1u<<25)
#define USART_CR3_TCBGTIE                                           (0x1u<<24)
#define USART_CR3_TXFTIE                                            (0x1u<<23)
#define USART_CR3_WUFIE                                             (0x1u<<22)
#define USART_CR3_WUS1                                              (0x1u<<21)
#define USART_CR3_WUS0                                              (0x1u<<20)
#define USART_CR3_SCARCNT                                           (0x7u<<17)
#define USART_CR3_SCARCNT_0                                         (0x1u<<17)
#define USART_CR3_DEP                                               (0x1u<<15)
#define USART_CR3_DEM                                               (0x1u<<14)
#define USART_CR3_DDRE                                              (0x1u<<13)
#define USART_CR3_OVRDIS                                            (0x1u<<12)
#define USART_CR3_ONEBIT                                            (0x1u<<11)
#define USART_CR3_CTSIE                                             (0x1u<<10)
#define USART_CR3_CTSE                                              (0x1u<<9)
#define USART_CR3_RTSE                                              (0x1u<<8)
#define USART_CR3_DMAT                                              (0x1u<<7)
#define USART_CR3_DMAR                                              (0x1u<<6)
#define USART_CR3_SCEN                                              (0x1u<<5)
#define USART_CR3_NACK                                              (0x1u<<4)
#define USART_CR3_HDSEL                                             (0x1u<<3)
#define USART_CR3_IRLP                                              (0x1u<<2)
#define USART_CR3_IREN                                              (0x1u<<1)
#define USART_CR3_EIE                                               (0x1u<<0)

