Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_usart.h
#define USART_CR3_TXFTCFG_B_0X0                                     (0x0u<<29)
#define USART_CR3_TXFTCFG_B_0X1                                     (0x1u<<29)
#define USART_CR3_TXFTCFG_B_0X2                                     (0x2u<<29)
#define USART_CR3_TXFTCFG_B_0X3                                     (0x3u<<29)
#define USART_CR3_TXFTCFG_B_0X4                                     (0x4u<<29)
#define USART_CR3_TXFTCFG_B_0X5                                     (0x5u<<29)
#define USART_CR3_RXFTIE_B_0X0                                      (0x0u<<28)
#define USART_CR3_RXFTIE_B_0X1                                      (0x1u<<28)
#define USART_CR3_RXFTCFG_B_0X0                                     (0x0u<<25)
#define USART_CR3_RXFTCFG_B_0X1                                     (0x1u<<25)
#define USART_CR3_RXFTCFG_B_0X2                                     (0x2u<<25)
#define USART_CR3_RXFTCFG_B_0X3                                     (0x3u<<25)
#define USART_CR3_RXFTCFG_B_0X4                                     (0x4u<<25)
#define USART_CR3_RXFTCFG_B_0X5                                     (0x5u<<25)
#define USART_CR3_TCBGTIE_B_0X0                                     (0x0u<<24)
#define USART_CR3_TCBGTIE_B_0X1                                     (0x1u<<24)
#define USART_CR3_TXFTIE_B_0X0                                      (0x0u<<23)
#define USART_CR3_TXFTIE_B_0X1                                      (0x1u<<23)
#define USART_CR3_WUFIE_B_0X0                                       (0x0u<<22)
#define USART_CR3_WUFIE_B_0X1                                       (0x1u<<22)
#define USART_CR3_WUS1_B_0X0                                        (0x0u<<21)
#define USART_CR3_WUS1_B_0X1                                        (0x1u<<21)
#define USART_CR3_WUS0_B_0X0                                        (0x0u<<20)
#define USART_CR3_WUS0_B_0X1                                        (0x1u<<20)
#define USART_CR3_SCARCNT_B_0X0                                     (0x0u<<17)
#define USART_CR3_DEP_B_0X0                                         (0x0u<<15)
#define USART_CR3_DEP_B_0X1                                         (0x1u<<15)
#define USART_CR3_DEM_B_0X0                                         (0x0u<<14)
#define USART_CR3_DEM_B_0X1                                         (0x1u<<14)
#define USART_CR3_DDRE_B_0X0                                        (0x0u<<13)
#define USART_CR3_DDRE_B_0X1                                        (0x1u<<13)
#define USART_CR3_OVRDIS_B_0X0                                      (0x0u<<12)
#define USART_CR3_OVRDIS_B_0X1                                      (0x1u<<12)
#define USART_CR3_ONEBIT_B_0X0                                      (0x0u<<11)
#define USART_CR3_ONEBIT_B_0X1                                      (0x1u<<11)
#define USART_CR3_CTSIE_B_0X0                                       (0x0u<<10)
#define USART_CR3_CTSIE_B_0X1                                       (0x1u<<10)
#define USART_CR3_CTSE_B_0X0                                        (0x0u<<9)
#define USART_CR3_CTSE_B_0X1                                        (0x1u<<9)
#define USART_CR3_RTSE_B_0X0                                        (0x0u<<8)
#define USART_CR3_RTSE_B_0X1                                        (0x1u<<8)
#define USART_CR3_DMAT_B_0X1                                        (0x1u<<7)
#define USART_CR3_DMAT_B_0X0                                        (0x0u<<7)
#define USART_CR3_DMAR_B_0X1                                        (0x1u<<6)
#define USART_CR3_DMAR_B_0X0                                        (0x0u<<6)
#define USART_CR3_SCEN_B_0X0                                        (0x0u<<5)
#define USART_CR3_SCEN_B_0X1                                        (0x1u<<5)
#define USART_CR3_NACK_B_0X0                                        (0x0u<<4)
#define USART_CR3_NACK_B_0X1                                        (0x1u<<4)
#define USART_CR3_HDSEL_B_0X0                                       (0x0u<<3)
#define USART_CR3_HDSEL_B_0X1                                       (0x1u<<3)
#define USART_CR3_IRLP_B_0X0                                        (0x0u<<2)
#define USART_CR3_IRLP_B_0X1                                        (0x1u<<2)
#define USART_CR3_IREN_B_0X0                                        (0x0u<<1)
#define USART_CR3_IREN_B_0X1                                        (0x1u<<1)
#define USART_CR3_EIE_B_0X0                                         (0x0u<<0)
#define USART_CR3_EIE_B_0X1                                         (0x1u<<0)

// BRR Configuration

#define USART_BRR_BRR                                               (0xFFFFu<<0)
#define USART_BRR_BRR_0                                             (0x1u<<0)

// GTPR Configuration

#define USART_GTPR_GT                                               (0xFFu<<8)
#define USART_GTPR_GT_0                                             (0x1u<<8)
#define USART_GTPR_PSC                                              (0xFFu<<0)
#define USART_GTPR_PSC_0                                            (0x1u<<0)

#define USART_GTPR_PSC_B_0X0_IRDA_LOW_POWER_AND_NORMAL_IRDA_MODE    (0x0u<<0)
#define USART_GTPR_PSC_B_0X1_IRDA_LOW_POWER_AND_NORMAL_IRDA_MODE    (0x1u<<0)
#define USART_GTPR_PSC_B_0X2_IRDA_LOW_POWER_AND_NORMAL_IRDA_MODE    (0x2u<<0)
#define USART_GTPR_PSC_B_0X3_SMARTCARD_MODE                         (0x3u<<0)

// RTOR Configuration

#define USART_RTOR_BLEN                                             (0xFFu<<24)
#define USART_RTOR_BLEN_0                                           (0x1u<<24)
#define USART_RTOR_RTO                                              (0xFFFFFFu<<0)
#define USART_RTOR_RTO_0                                            (0x1u<<0)

// RQR Configuration

#define USART_RQR_TXFRQ                                             (0x1u<<4)
#define USART_RQR_RXFRQ                                             (0x1u<<3)
#define USART_RQR_MMRQ                                              (0x1u<<2)
#define USART_RQR_SBKRQ                                             (0x1u<<1)
#define USART_RQR_ABRRQ                                             (0x1u<<0)

// ISR Configuration

#define USART_ISR_TXFT                                              (0x1u<<27)
#define USART_ISR_RXFT                                              (0x1u<<26)
#define USART_ISR_TCBGT                                             (0x1u<<25)
#define USART_ISR_RXFF                                              (0x1u<<24)
#define USART_ISR_TXFE                                              (0x1u<<23)
#define USART_ISR_REACK                                             (0x1u<<22)
#define USART_ISR_TEACK                                             (0x1u<<21)
#define USART_ISR_WUF                                               (0x1u<<20)
#define USART_ISR_RWU                                               (0x1u<<19)
#define USART_ISR_SBKF                                              (0x1u<<18)
#define USART_ISR_CMF                                               (0x1u<<17)
#define USART_ISR_BUSY                                              (0x1u<<16)
#define USART_ISR_ABRF                                              (0x1u<<15)
#define USART_ISR_ABRE                                              (0x1u<<14)
#define USART_ISR_UDR                                               (0x1u<<13)
#define USART_ISR_EOBF                                              (0x1u<<12)
#define USART_ISR_RTOF                                              (0x1u<<11)
#define USART_ISR_CTS                                               (0x1u<<10)
#define USART_ISR_CTSIF                                             (0x1u<<9)
#define USART_ISR_LBDF                                              (0x1u<<8)
#define USART_ISR_TXFNF                                             (0x1u<<7)
#define USART_ISR_TC                                                (0x1u<<6)
#define USART_ISR_RXFNE                                             (0x1u<<5)
#define USART_ISR_IDLE                                              (0x1u<<4)
#define USART_ISR_ORE                                               (0x1u<<3)
#define USART_ISR_NE                                                (0x1u<<2)
#define USART_ISR_FE                                                (0x1u<<1)
#define USART_ISR_PE                                                (0x1u<<0)

