Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_usart.h
#define USART_ISR_TXFT_B_0X0                                        (0x0u<<27)
#define USART_ISR_TXFT_B_0X1                                        (0x1u<<27)
#define USART_ISR_RXFT_B_0X0                                        (0x0u<<26)
#define USART_ISR_RXFT_B_0X1                                        (0x1u<<26)
#define USART_ISR_TCBGT_B_0X0                                       (0x0u<<25)
#define USART_ISR_TCBGT_B_0X1                                       (0x1u<<25)
#define USART_ISR_RXFF_B_0X0                                        (0x0u<<24)
#define USART_ISR_RXFF_B_0X1                                        (0x1u<<24)
#define USART_ISR_TXFE_B_0X0                                        (0x0u<<23)
#define USART_ISR_TXFE_B_0X1                                        (0x1u<<23)
#define USART_ISR_RWU_B_0X0                                         (0x0u<<19)
#define USART_ISR_RWU_B_0X1                                         (0x1u<<19)
#define USART_ISR_SBKF_B_0X0                                        (0x0u<<18)
#define USART_ISR_SBKF_B_0X1                                        (0x1u<<18)
#define USART_ISR_CMF_B_0X0                                         (0x0u<<17)
#define USART_ISR_CMF_B_0X1                                         (0x1u<<17)
#define USART_ISR_BUSY_B_0X0                                        (0x0u<<16)
#define USART_ISR_BUSY_B_0X1                                        (0x1u<<16)
#define USART_ISR_UDR_B_0X0                                         (0x0u<<13)
#define USART_ISR_UDR_B_0X1                                         (0x1u<<13)
#define USART_ISR_EOBF_B_0X0                                        (0x0u<<12)
#define USART_ISR_EOBF_B_0X1                                        (0x1u<<12)
#define USART_ISR_RTOF_B_0X0                                        (0x0u<<11)
#define USART_ISR_RTOF_B_0X1                                        (0x1u<<11)
#define USART_ISR_CTS_B_0X0                                         (0x0u<<10)
#define USART_ISR_CTS_B_0X1                                         (0x1u<<10)
#define USART_ISR_CTSIF_B_0X0                                       (0x0u<<9)
#define USART_ISR_CTSIF_B_0X1                                       (0x1u<<9)
#define USART_ISR_LBDF_B_0X0                                        (0x0u<<8)
#define USART_ISR_LBDF_B_0X1                                        (0x1u<<8)
#define USART_ISR_TXFNF_B_0X0                                       (0x0u<<7)
#define USART_ISR_TXFNF_B_0X1                                       (0x1u<<7)
#define USART_ISR_RXFNE_B_0X0                                       (0x0u<<5)
#define USART_ISR_RXFNE_B_0X1                                       (0x1u<<5)
#define USART_ISR_IDLE_B_0X0                                        (0x0u<<4)
#define USART_ISR_IDLE_B_0X1                                        (0x1u<<4)
#define USART_ISR_ORE_B_0X0                                         (0x0u<<3)
#define USART_ISR_ORE_B_0X1                                         (0x1u<<3)
#define USART_ISR_NE_B_0X0                                          (0x0u<<2)
#define USART_ISR_NE_B_0X1                                          (0x1u<<2)
#define USART_ISR_FE_B_0X0                                          (0x0u<<1)
#define USART_ISR_FE_B_0X1                                          (0x1u<<1)
#define USART_ISR_PE_B_0X0                                          (0x0u<<0)
#define USART_ISR_PE_B_0X1                                          (0x1u<<0)

// ICR Configuration

#define USART_ICR_WUCF                                              (0x1u<<20)
#define USART_ICR_CMCF                                              (0x1u<<17)
#define USART_ICR_UDRCF                                             (0x1u<<13)
#define USART_ICR_EOBCF                                             (0x1u<<12)
#define USART_ICR_RTOCF                                             (0x1u<<11)
#define USART_ICR_CTSCF                                             (0x1u<<9)
#define USART_ICR_LBDCF                                             (0x1u<<8)
#define USART_ICR_TCBGTCF                                           (0x1u<<7)
#define USART_ICR_TCCF                                              (0x1u<<6)
#define USART_ICR_TXFECF                                            (0x1u<<5)
#define USART_ICR_IDLECF                                            (0x1u<<4)
#define USART_ICR_ORECF                                             (0x1u<<3)
#define USART_ICR_NECF                                              (0x1u<<2)
#define USART_ICR_FECF                                              (0x1u<<1)
#define USART_ICR_PECF                                              (0x1u<<0)

// RDR Configuration

#define USART_RDR_RDR                                               (0x1FFu<<0)
#define USART_RDR_RDR_0                                             (0x1u<<0)

// TDR Configuration

#define USART_TDR_TDR                                               (0x1FFu<<0)
#define USART_TDR_TDR_0                                             (0x1u<<0)

// PRESC Configuration

#define USART_PRESC_PRESCALER                                       (0xFu<<0)
#define USART_PRESC_PRESCALER_0                                     (0x1u<<0)

#define USART_PRESC_PRESCALER_B_0X0                                 (0x0u<<0)
#define USART_PRESC_PRESCALER_B_0X1                                 (0x1u<<0)
#define USART_PRESC_PRESCALER_B_0X2                                 (0x2u<<0)
#define USART_PRESC_PRESCALER_B_0X3                                 (0x3u<<0)
#define USART_PRESC_PRESCALER_B_0X4                                 (0x4u<<0)
#define USART_PRESC_PRESCALER_B_0X5                                 (0x5u<<0)
#define USART_PRESC_PRESCALER_B_0X6                                 (0x6u<<0)
#define USART_PRESC_PRESCALER_B_0X7                                 (0x7u<<0)
#define USART_PRESC_PRESCALER_B_0X8                                 (0x8u<<0)
#define USART_PRESC_PRESCALER_B_0X9                                 (0x9u<<0)
#define USART_PRESC_PRESCALER_B_0XA                                 (0xAu<<0)
#define USART_PRESC_PRESCALER_B_0XB                                 (0xBu<<0)
